Version2/TestTool 1.2 Service Release/TestTool.Setup/Requests/Imaging Configuration/SetImagingSettings/TC.IC.NVT.02_REQ_02.xml

<?xml version='1.0' encoding='utf-8'?>
<s:Envelope
 xmlns:s="http://www.w3.org/2003/05/soap-envelope"
 xmlns:timg="http://www.onvif.org/ver10/imaging/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <s:Body>
    <timg:SetImagingSettings>
      <timg:VideoSourceToken>cam1</timg:VideoSourceToken>
      <timg:ImagingSettings>
        <tt:Brightness>54</tt:Brightness>
        <tt:ColorSaturation>50</tt:ColorSaturation>
        <tt:Contrast>57</tt:Contrast>
        <tt:Sharpness>50</tt:Sharpness>
      </timg:ImagingSettings>
      <timg:ForcePersistence xmlns="">true</timg:ForcePersistence>
    </timg:SetImagingSettings>
  </s:Body>
</s:Envelope>